eid-trust-service-tests/src/test/resources/test-soap-message.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
	soap:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"
	xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
	xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/
               http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Header>
		<tns:header soap:mustUnderstand="1" xmlns:tns="urn:test">
			Hello World
		</tns:header>
	</soap:Header>
	<soap:Body>
		<tns:root xmlns:tns="urn:test">Hello World</tns:root>
	</soap:Body>
</soap:Envelope>
